---
type: SaveOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# SaveOptions

`Autodesk.Revit.DB.SaveOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SaveOptions | 2012 | `public SaveOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Compact | 2014 | `public bool Compact { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PreviewViewId | 2012 | `public ElementId PreviewViewId { get ; set ; }` |